# 声母对照
INITIAL_RULER = [
    # 国际音标 —— 拼音符号
    ('t', 'd'),
    ('th', 't'),
    ('tɕ', 'j'),
    ('tɕh', 'q'),
    #
    ('p', 'b'),
    ('ph', 'p'),
    ('ts', 'z'),
    ('tsh', 'c'),
    ('z', 'r'),
    ('m', 'm'),
    #
    ('j', 'y'),
    ('n', 'n'),
    ('l', 'l'),
    ('k', 'g'),
    ('kh', 'k'),
    ('ɕ', 'x'),
    ('s', 's'),
    ('ɣ', 'hh'),
    ('x', 'h'),
    ('w', 'w'),

    # 以下为自己加的
    ('ʨ', 'j'),
    ('ʦ','z'),
    ('ʨh', 'q'),
    ('ŋ', 'n'),
    ('ʦh','c')
]

# 韵母对照

FINAL_RULER = [
    #
    ('ŋ', 'ng'),
    ('a', 'a'),
    ('ɨ', 'ii'),
    ('ei', 'ei'),
    ('ia', 'ia'),
    ('ɨu', 'ou'),
    ('uai', 'uai'),
    ('ẽ', 'en'),
    ('iã', 'ian'),
    ('iũ', 'ion'),
    #
    ('e', 'e'),
    ('o', 'o'),
    ('ai', 'ai'),
    ('iu', 'iu'),
    ('ua', 'ua'),
    ('uei', 'uei'),
    ('ã', 'an'),
    ('uẽ', 'uen'),
    #
    ('i', 'i'),
    ('u', 'u'),
    ('au', 'ao'),
    ('ɨe', 'oe'),
    ('iau', 'iao'),
    ('ĩ', 'in'),
    ('ũ', 'on'),
    ('uã', 'uan'),

    # 以下是自己加的
    ('auɪ','uai'),
    ('aɪ', 'ai'),
    ('ui', 'ui'),
    ('oɪ', 'oi'),
    ('io', 'io'),
    ('eɪ', 'ei'),
    ('iɪ', 'ii'),
]